package com.javarush.task.task10.task1011;

public class Solution {
    public static void main(String[] args) {
        String s = "Я не хочу изучать Java, я хочу большую зарплату";

        //напишите тут ваш код
        for (int i = 0; i < 40; i++) {
            System.out.println(s.substring(i));
        }
    }
}
/*public class Solution {
    public static void main(String[] args) {
        String s = "Я не хочу изучать Java, я хочу большую зарплату";

        //напишите тут ваш код
    }
}*/

/*
Лень-матушка! Твои верные апологеты повсюду!
Ты — двигатель прогресса и разушитель мечаний.
И даже тот, кто сейчас читает эти строки, наверняка находился под твоим влияинем, думая:
«зачем мне эта Java, ну её, столько усилий трачу!».
Специально для вас — задача: вывести на экран фразу
«Я не хочу изучать Java, я хочу большую зарплату».
И так — 40 раз.

Большая зарплата
Вывести на экран надпись «Я не хочу изучать Java, я хочу большую зарплату» 40 раз по образцу.

Образец:
Я не хочу изучать Java, я хочу большую зарплату
 не хочу изучать Java, я хочу большую зарплату
не хочу изучать Java, я хочу большую зарплату
е хочу изучать Java, я хочу большую зарплату
 хочу изучать Java, я хочу большую зарплату
хочу изучать Java, я хочу большую зарплату
…
зарплату


Требования:
1. Программа должна выводить текст на экран.
2. Программа должна выводить 40 строк.
3. В программе должен использоваться цикл for или while.
4. Выведенный текст должен соответствовать примеру из условия.
*/

